hybridMultiphaseFoamV7/tutorials/Free_Flow_Cases/Capillary_Rise/porous_Boundary/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.wetting 0
    volScalarFieldValue eps 1
);

regions
(
    boxToCell
    {
        box (0 0 -1) (1e-3 8e-3 1);

        fieldValues
        (
            volScalarFieldValue alpha.wetting 1
        );
    }

    boxToCell
    {
        box (-1 0 0) (0 1 1);

        fieldValues
        (
            volScalarFieldValue eps 0.001
            //volScalarFieldValue alpha.wetting 1
        );
    }

 boxToCell
    {
        box (1e-3 0 0) (1 1 1);

        fieldValues
        (
            volScalarFieldValue eps 0.001
            //volScalarFieldValue alpha.wetting 1
        );
    }


);


// ************************************************************************* //
